package com.wqz.allinone.act.about.data

/**
 * 版本更新日志
 * Created by Wu Qizhen on 2024.12.31
 */
object UpdateLogData {
    val updateLogs = listOf(
        UpdateLog(
            "🍋‍🟩 Indigo",
            "靛蓝色，深邃和智慧",
            "2025.2.4",
            """
                |» 新增
                | - ⌈恢复与导入⌋：一键恢复数据，轻松恢复之前已保存的数据
                |» 优化
                | - ⌈备份与导出⌋ 多次导出
                | - ⌈待办箱⌋ 清空按钮动画
            """.trimMargin()
        ),
        UpdateLog(
            "🧬 Helix",
            "螺旋，发展和进步",
            "2024.12.31",
            """
                |» 新增
                | - ⌈网格布局⌋：快速切换布局方式，适配不同场景下的最佳体验
                | - ⌈启动页⌋ 高斯模糊入场动画
                |» 优化
                | - ⌈备份与导出⌋ 导出选项
                | - ⌈备份与导出⌋ 导出逻辑
                | - ⌈备份与导出⌋ 导出结果显示
                | - ⌈身份校验⌋ 自动调出键盘
            """.trimMargin()
        ),
        UpdateLog(
            "🏠 Gallium",
            "融合和创新",
            "2024.12.22",
            """
                |» 优化
                | - 卡片圆角大小
                | - 按钮类型与颜色
            """.trimMargin()
        ),
        UpdateLog(
            "💎 Flint",
            "燧石，创新和火花",
            "2024.11.30",
            """
                |» 新增
                | - ⌈返回标题栏⌋：全局标题栏一键返回
                | - ⌈隐私与安全⌋：管理隐私和数据安全
                | - ⌈备份与导出⌋：备份或导出数据至本地存储
                | - ⌈智慧盒⌋：便捷的知识记忆助手，随地巩固和复习知识点，轻松利用碎片时间
                | - ⌈纪念日⌋ 卡片全屏显示
                | - ⌈书签宝⌋ 批量导入书签
                |» 优化
                | - 统一提示文本
                | - 统一界面布局
                | - 统一界面组件
                | - 全局按压动画
            """.trimMargin()
        ),
        UpdateLog(
            "💍 Emerald",
            "翡翠，持久和珍贵",
            "2024.11.10",
            """
                |⚠ 重要特性
                | - Powered by Aethex Matrix ®：原生奥境智构矩阵重构应用
                |» 新增
                | - ⌈生活书⌋：生活记录工具，记录生活中的点滴故事、成长历程和美好时光。以时间为轴，串联起生活点滴，让回忆更加温馨美好
                |» 优化
                | - 主题渲染效果
                | - 多处细节优化
            """.trimMargin()
        ),
        UpdateLog(
            "🐟 Dorado",
            "剑鱼座，力量和速度",
            "2024.10.02",
            """
                |⚠ 重要特性
                | - Built with Aethex Matrix ®：重构启动页、主页、待办箱
                |» 新增
                | - ⌈纪念日⌋ 一键跳转当日
                | - ⌈待办箱⌋ 待办事件修改
                |» 优化
                | - ⌈待办箱⌋ 界面重构
                | - ⌈纪念日⌋ 信息卡片样式
                | - ⌈纪念日⌋ 日期计算逻辑
                | - ⌈随手记⌋ 列表排列方式
            """.trimMargin()
        ),
        UpdateLog(
            "🦢 Cygnus",
            "天鹅座，优雅和远见",
            "2024.08.20",
            "» 新增" +
                    "\n - ⌈纪念日⌋：贴心的时间提醒功能，记录和提醒重要的日子，如生日、结婚纪念日、节日等，不再错过每一个值得纪念的时刻"
        ),
        UpdateLog(
            "⛵ Bismuth",
            "独特和坚韧",
            "2024.07.01",
            "» 新增" +
                    "\n - ⌈随手记⌋：便捷的记事本功能，随时随地记录生活中的点滴感悟、灵感迸发和重要信息。轻松一点，快速记录，再也不怕遗忘那些精彩瞬间"
        ),
        UpdateLog(
            "✨ Aurora",
            "新的开始，像极光一样引人注目",
            "2024.06.22",
            "» 新增" +
                    "\n - ⌈待办箱⌋：高效的任务管理工具，记录和跟踪日常生活中需要完成的各项事务。让工作和生活更有条理，提高办事效率" +
                    "\n - ⌈书签宝⌋：实用的网页收藏夹，收藏和管理各种感兴趣的网页资源"
        )
    )
}